def welcome(name: str, bot_name: str) -> str:
    return (
        f"👋 Привет, {name}!\n\n"
        f"Добро пожаловать в ряды неравнодушных граждан. Вместе мы сможем изменить происходящее к лучшему!\n\n"
        "Выберите нужное действие:"
    )


INFO_MENU = "📩 Сообщить важную информацию\n\nВыберите, что хотите сообщить:"
WAITING_INFO = "✍️ Напишите информацию сообщением.\n\nПосле отправки она будет передана администратору, который отвечает за соответствующую область"
MESSAGE_SENT = "✅ Информация отправлена администратору."
CANCELLED = "↩️ Действие отменено."

JOIN_REQUEST_TEXT = "🔔 <b>Новая заявка на вступление</b>"


DONAT_TEXT = "❤️ Поддержать проекты"
CHAT_TEXT = "💬 Перейти в чат единомышленников"
